using System;


namespace Ex03.GarageLogic
{
    public class GenerateVehicles
    {
        /*TODO: עושה רק שני דברים:
         1.מחזיקה את רשימת האופציות של רכבים (5 אופציות)
        אם נרצה להוסיף טרקטור נוסיף רק אופציה אחת
        2. מייצרת את האובייקטים
        עושה NEW
        אם נרצה להוסיף טרקטור רק נעשה עוד איף אלס ונוסיף טרקטור
         */

        
    }
}


//TODO: הפניה למחלקה זו לייצר אובייקט מתבצעת אחרי שהמשתמש הזין איזה כלי רכב הוא רוצה
//ולפני שהוא הזין את הפרטים
//בעולם האמיתי קודם מייצרים מכונית ואז מוסיפים לה אוויר בגלגלים וכו וכו
